yutaka-ishikawa/portable-tls-ra/tls_sgx/Enclave/tlsra_client.c
/*
 * Testing TLS-RA
 *	2025/10/5
 */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <netdb.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <openssl/ssl.h>
#include <openssl/err.h>

#include <sgxenv.h>
#include <ptlsra.h>
#include "tlsra_test.h"

unsigned char	buf[BUF_SIZE];
unsigned char	buf2[BUF_SIZE];
int	dflag = 0;
int	tflag = 0;
int	vflag = 0;
int	rflag = 0;
int	atflag = 0;	/* using Attester Daemon */
char	*dpath;
char	*server_ipaddr = NULL;

union unip {
    uint8_t	addr[4];
    uint32_t	ip;
};

char *
ipaddr(uint32_t ip)
{
    static char buf[32];
    union unip	un;
    un.ip = ip;
    snprintf(buf, 32,
	     "%03d.%03d.%03d.%03d", un.addr[0], un.addr[1], un.addr[2], un.addr[3]);
    return buf;
}

uint32_t
stripaddr(char *addr)
{
    int i, j, pos;
    union unip	un;
    j = 0;
    pos = 0;
    printf("strip = ");
    while(*addr != 0) {
	if (*addr == '.') {
	    printf("%d.", j);
	    un.addr[pos] = j;
	    pos++;
	    j = 0;
	} else {
	    j = j*10 + (*addr - '0');
	}
	addr++;
    }
    un.addr[pos] = j;
    printf("%d\n", j);
    return un.ip;
}

#ifdef SGXENV
static void
getclocktime(int64_t *sec, int64_t *nsec)
{
    ocall_getclocktime(sec, nsec);
}
#else
static void
getclocktime(int64_t *sec, int64_t *nsec)
{
    struct timespec	ts;
    if (clock_gettime(CLOCK_MONOTONIC, &ts) != 0) {
	*sec = 0;
	*nsec = 0;
	return;
    }
    *sec  = (unt64_t)ts.tv_sec;
    *nsec = (unt64_t)ts.tv_nsec;
}
#endif

static float
time_to_msec(int64_t st_sec, int64_t st_nsec, int64_t et_sec, int64_t et_nsec)
{
    int64_t sec = et_sec - st_sec;
    int64_t nsec = et_nsec - st_nsec;
    double msec;
    printf("sec(%f) nsec(%f)\n", (float) sec, (float) nsec);
    msec = (((double)sec*1000) + (double)(nsec)/(double)1000000);
    return (float) msec;
}

static int
sslwrite(SSL *ssl, unsigned char *bp, int wsiz, int cnt)
{
    int	i, rc;
    for (i = 0; i < cnt; i++) {
	VERBOSE {
	    printf("%s: sending data size(%d)\n", __func__,  wsiz);
	}
	TLSRA_SSLCALLN0(err, rc, SSL_write(ssl, bp, wsiz));
	VERBOSE {
	    printf("%s: sent size(%d)\n", __func__,  rc);
	}
    }
err:
    return rc;
}


static int
tcpwrite(int sock, unsigned char *bp, int rsz, int cnt)
{
    ssize_t	sz;
    int	i;
    for (i = 0; i < cnt; i++) {
	VERBOSE {
	    printf("%s: sending data size(%ld)\n", __func__,  sz);
	}
	sz = write(sock, bp, rsz);
	if (sz != rsz) {
	    perror("write");
	    break;
	}
	VERBOSE {
	    printf("%s: sent size(%ld)\n", __func__,  sz);
	}
    }
    return (int)sz;
}


static int
getoption(int argc, char **argv)
{
    int	i;
    for (i = 1; i < argc; i++) {
	printf("argv[%d] = %s\n", i, argv[i]);
	if (argv[i][0] == '-') {
	    switch (argv[i][1]) {
	    case 'd':
		dflag = 1; break;
	    case 'D': /* using Attester Daemon */
		atflag = 1;
		dpath = strndup(argv[i+1], 108); i++;
		break;
	    case 'r': /* remote attestation */
		rflag = atol(argv[i+1]); i++; break;
	    case 's': /* server ip */
		server_ipaddr = strndup(argv[i+1], 80); i++;
		break;
	    case 't': if (i > argc) goto err;
		tflag = atol(argv[i+1]); i++; printf("tflag is set\n"); break;
	    case 'v':
		vflag = 1; printf("vflag is set\n"); break;
	    }
	} else {
	    break;
	}
    }
    return i;
err:
    printf("A few arguments\n");
    return -1;
}

int
main(int argc, char **argv)
{
    int		sock;
    SSL		*ssl = NULL;
    SSL_CTX	*ctx = NULL;
    uint32_t	ip = 0x100007f;	/* localhost */
    uint16_t	port = DEFAULT_TCP_PORT;
    int		count = DEFAULT_COUNT;
    int		size = DEFAULT_SIZE;
    int64_t	st_sec, st_nsec, et_sec, et_nsec;
    float	lat;
    int		rc;

    getoption(argc, argv);
    printf("Enclave: dflag = %d\n", dflag);
    combuf_init(buf, BUF_SIZE);
    SSL_load_error_strings();
    SSL_library_init();
    TLSRA_SSLCALLP(err, ctx, SSL_CTX_new(SSLv23_client_method()));
    /*
     * Handling Handshake during client hello message
     */
    TLSRA_client_init(ctx, 1);

    /*
     * Now SSL is now created from SSL_CTX.
     */
    TLSRA_SSLCALLP(err, ssl, SSL_new(ctx));

    if (server_ipaddr) {
	ip = stripaddr(server_ipaddr);
	printf("string ip address = %s\n", server_ipaddr);
    }
    printf("ip=0x%x port=%d\n", ip, port);
    sock = sock_connect(ip, port);
    if (sock < 0) {
	fprintf(stderr, "???? \n");
	return -1;
    }

    TLSRA_SSLCALL(err, rc, SSL_set_fd(ssl, sock));

    getclocktime(&st_sec, &st_nsec);
    TLSRA_SSLCALL(err, rc, SSL_connect(ssl));
    getclocktime(&et_sec, &et_nsec);
    
    printf("***********************************\n");
    printf("****** Conntect to %s \n", ipaddr(ip));
    printf("***********************************\n");
    printf("start sec:(%d) nsec(%d)\n", st_sec, st_nsec);
    printf("end sec(%d) nsec(%d)\n", et_sec, et_nsec);
    lat =  time_to_msec(st_sec, st_nsec, et_sec, et_nsec);
    printf("latency(msec): %f\n", lat);
#define MEASURE_KEYPAIR /* FIXME: temporal hacking */
#ifdef MEASURE_KEYPAIR
    {
	extern int64_t	mkp_st_sec, mkp_st_nsec, mkp_et_sec, mkp_et_nsec;
	float	cost;
	printf("keypair generation:start sec:(%d) nsec(%d)\n",
	       mkp_st_sec, mkp_st_nsec);
	printf("keypair generation: end sec(%d) nsec(%d)\n",
	       mkp_et_sec, mkp_et_nsec);
	cost = time_to_msec(mkp_st_sec, mkp_st_nsec, mkp_et_sec, mkp_et_nsec);
	printf("Keypair generation time(msec): %f\n", cost);
    }
#endif /* MEASURE_KEYPAIR */

    /* showing nonces of both client and server */
    VERBOSE {
	TLSRA_show_nonce(ssl);
    }

    /* main */
    printf("SSL TEST\n");
    sslwrite(ssl, buf, size, count);
    /* finalizing */
    myssl_shutdown(ctx, ssl);
    TLSRA_SYSCALL(ext2, rc, close(sock), "close");
ext2:
    return 0;
err:
    fprintf(stderr, "ERROR\n");
    ERR_print_errors_cb(myssl_printerr, NULL);
    if (ssl) SSL_free(ssl);
    if (ctx) SSL_CTX_free(ctx);
    goto err;
}
